// automatically generated by rust-bindgen

/// A group that associates JavaScript contexts with one another.
/// Contexts in the same group may share and exchange JavaScript objects.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSContextGroup([u8; 0]);

/// A group that associates JavaScript contexts with one another.
/// Contexts in the same group may share and exchange JavaScript objects.
pub type JSContextGroupRef = *const OpaqueJSContextGroup;

/// A JavaScript execution context. Holds the global object and
/// other execution state.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSContext([u8; 0]);

/// A JavaScript execution context. Holds the global object and
/// other execution state.
pub type JSContextRef = *const OpaqueJSContext;

/// A global JavaScript execution context.
/// A `JSGlobalContext` is a `JSContext`.
pub type JSGlobalContextRef = *mut OpaqueJSContext;

/// A UTF16 character buffer. The fundamental string representation
/// in JavaScript.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSString([u8; 0]);

/// A UTF16 character buffer. The fundamental string representation
/// in JavaScript.
pub type JSStringRef = *mut OpaqueJSString;

/// A JavaScript class.
/// Used with `JSObjectMake` to construct objects with custom behavior.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpaqueJSClass([u8; 0]);

/// A JavaScript class.
/// Used with `JSObjectMake` to construct objects with custom behavior.

                             propertyName: JSStringRef,
                             exception: *mut JSValueRef)
                             -> *const OpaqueJSValue,
    >;
pub type JSObjectSetPropertyCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             object: JSObjectRef,
                             propertyName: JSStringRef,
                             value: JSValueRef,
                             exception: *mut JSValueRef)
                             -> bool,
    >;
pub type JSObjectDeletePropertyCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             object: JSObjectRef,
                             propertyName: JSStringRef,
                             exception: *mut JSValueRef)
                             -> bool,
    >;
pub type JSObjectGetPropertyNamesCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             object: JSObjectRef,
                             propertyNames: JSPropertyNameAccumulatorRef),
    >;
pub type JSObjectCallAsFunctionCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             function: JSObjectRef,
                             thisObject: JSObjectRef,
                             argumentCount: usize,
                             arguments: *const JSValueRef,
                             exception: *mut JSValueRef)
                             -> *const OpaqueJSValue,
    >;
pub type JSObjectCallAsConstructorCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             constructor: JSObjectRef,
                             argumentCount: usize,
                             arguments: *const JSValueRef,
                             exception: *mut JSValueRef)
                             -> *mut OpaqueJSValue,
    >;
pub type JSObjectHasInstanceCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             constructor: JSObjectRef,
                             possibleInstance: JSValueRef,
                             exception: *mut JSValueRef)
                             -> bool,
    >;
pub type JSObjectConvertToTypeCallback =
    ::std::option::Option<
        unsafe extern "C" fn(ctx: JSContextRef,
                             object: JSObjectRef,
                             type_: JSType,
                             exception: *mut JSValueRef)
                             -> *const OpaqueJSValue,
    >;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct JSStaticValue {
    pub name: *const ::std::os::raw::c_char,
    pub getProperty: JSObjectGetPropertyCallback,
    pub setProperty: JSObjectSetPropertyCallback,
    pub attributes: JSPropertyAttributes,
}
#[test]
fn bindgen_test_layout_JSStaticValue() {
    assert_eq!(
        ::std::mem::size_of::<JSStaticValue>(),
        32usize,
        concat!("Size of: ", stringify!(JSStaticValue))
    );
    assert_eq!(
        ::std::mem::align_of::<JSStaticValue>(),
        8usize,
        concat!("Alignment of ", stringify!(JSStaticValue))
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticValue)).name as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticValue)).getProperty as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(getProperty)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticValue)).setProperty as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(setProperty)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticValue)).attributes as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticValue),
            "::",
            stringify!(attributes)
        )
    );
}
impl Clone for JSStaticValue {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct JSStaticFunction {
    pub name: *const ::std::os::raw::c_char,
    pub callAsFunction: JSObjectCallAsFunctionCallback,
    pub attributes: JSPropertyAttributes,
}
#[test]
fn bindgen_test_layout_JSStaticFunction() {
    assert_eq!(
        ::std::mem::size_of::<JSStaticFunction>(),
        24usize,
        concat!("Size of: ", stringify!(JSStaticFunction))
    );
    assert_eq!(
        ::std::mem::align_of::<JSStaticFunction>(),
        8usize,
        concat!("Alignment of ", stringify!(JSStaticFunction))
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticFunction)).name as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticFunction),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticFunction)).callAsFunction as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticFunction),
            "::",
            stringify!(callAsFunction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSStaticFunction)).attributes as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSStaticFunction),
            "::",
            stringify!(attributes)
        )
    );
}
impl Clone for JSStaticFunction {
    fn clone(&self) -> Self {
        *self
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct JSClassDefinition {
    pub version: ::std::os::raw::c_int,
    pub attributes: JSClassAttributes,
    pub className: *const ::std::os::raw::c_char,
    pub parentClass: JSClassRef,
    pub staticValues: *const JSStaticValue,
    pub staticFunctions: *const JSStaticFunction,
    pub initialize: JSObjectInitializeCallback,
    pub finalize: JSObjectFinalizeCallback,
    pub hasProperty: JSObjectHasPropertyCallback,
    pub getProperty: JSObjectGetPropertyCallback,
    pub setProperty: JSObjectSetPropertyCallback,
    pub deleteProperty: JSObjectDeletePropertyCallback,
    pub getPropertyNames: JSObjectGetPropertyNamesCallback,
    pub callAsFunction: JSObjectCallAsFunctionCallback,
    pub callAsConstructor: JSObjectCallAsConstructorCallback,
    pub hasInstance: JSObjectHasInstanceCallback,
    pub convertToType: JSObjectConvertToTypeCallback,
}
#[test]
fn bindgen_test_layout_JSClassDefinition() {
    assert_eq!(
        ::std::mem::size_of::<JSClassDefinition>(),
        128usize,
        concat!("Size of: ", stringify!(JSClassDefinition))
    );
    assert_eq!(
        ::std::mem::align_of::<JSClassDefinition>(),
        8usize,
        concat!("Alignment of ", stringify!(JSClassDefinition))
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSClassDefinition)).version as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSClassDefinition)).attributes as *const _ as usize },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const JSClassDefinition)).className as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(JSClassDefinition),
            "::",
            stringify!(className)
        )
    );
    assert_eq!(
